src/cf/Enums/ВидыНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыНалогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрочиеНалогиИСборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль_ФедеральныйБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыль_РегиональныйБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородФедеральногоЗначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскойОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскойОкругСВнутригородскимДелением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ВнутригородскойОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_МежселеннаяТерритория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_СельскоеПоселение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗемельныйНалог_ГородскоеПоселение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТранспортныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаИмущество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаИмуществоЕСГС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_ДоходыМинусРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН_МинимальныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДФЛ_ИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕСХН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФСС_НСиПЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_СтраховаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_НакопительнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ПФР_Добровольные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносы_ФФОМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ЛетныеЭкипажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_Шахтеры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ВредныеУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВзносы_ПФР_ТяжелыеУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ПФР_СтраховаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ПФР_НакопительнаяЧасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ФФОМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеВзносы_ФСС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/УсловияПримененияТребованийЗаконодательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>УсловияПримененияТребованийЗаконодательства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮридическиеЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьСотрудники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховыеВзносыСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяСистемаНалогообложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпрощеннаяСистемаНалогообложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлательщикиНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлательщикиЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьЗемельныеУчастки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьТранспортныеСредства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьИмущество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскаяОтчетностьОбщаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскаяОтчетностьМалыеПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскаяОтчетностьНекоммерческиеОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БухгалтерскаяОтчетностьСоциальноОриентированные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыльАвансыЕжеквартально</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыльАвансыЕжемесячно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыльАвансыПоФактическойПрибыли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АкцизыОбщаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АкцизыОбщийСрок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АкцизыФормаТабак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АкцизыЛьготныйСрок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансыПоАкцизам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничнаяПродажаАлкоголя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптоваяТорговляАлкоголем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоАлгоколя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревозкаАлкоголя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачаВыбранаПользователем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПравилоВыбраноПользователем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеСтраховыеВзносы_Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныеСтраховыеВзносы_Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьПФРвЭлектронномВиде</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьПФРнаБумажномНосителе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьФССвЭлектронномВиде</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьФССнаБумажномНосителе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыПлатежейВГосБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВГосБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Налог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штраф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыПоСтрахованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениСам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПениАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоИзФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проценты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыНалоговИПлатежейВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыНалоговИПлатежейВБюджет</Name>
			<Comment>Налоги, взносы и иные платежи в бюджет</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Comment>Заполняется для поставляемых данных</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаКодБыстрогоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/РасчетыСБюджетом/Ext/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейсВидовНалогов

// Возвращает счет учета для указанного налога
//
Функция СчетУчета(ВидНалога, Знач Период = Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ТаблицаСоответствияСчетовУчета = ТаблицаСоответствияСчетовУчета();
	НайденныеСтроки = ТаблицаСоответствияСчетовУчета.НайтиСтроки(Новый Структура("ВидНалога", ВидНалога));
	
	Если НайденныеСтроки.Количество() = 1 Тогда
		
		СчетУчета = НайденныеСтроки[0].СчетУчета;
		
	ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
		// Есть устаревшие счета учета
		Если ВидНалога = Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_СтраховаяЧасть 
			Или ВидНалога = Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_СтраховаяЧасть Тогда
			
			Если Период < '20140101' Тогда
				СчетУчета = НайденныеСтроки[1].СчетУчета;
			Иначе
				СчетУчета = НайденныеСтроки[0].СчетУчета;
			КонецЕсли;
			
		Иначе
			СчетУчета = НайденныеСтроки[0].СчетУчета;
		КонецЕсли;
	Иначе
		СчетУчета = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	КонецЕсли;
	
	Возврат СчетУчета;
	
КонецФункции

Функция ВидНалогаПоСчетуУчета(СчетУчета, Организация = Неопределено, Знач Период = Неопределено, УровеньБюджета = Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СчетУчета) Тогда
		Возврат Перечисления.ВидыНалогов.ПустаяСсылка();
	ИначеЕсли СчетУчета = ПланыСчетов.Хозрасчетный.ПрочиеНалогиИСборы Тогда
		Возврат Перечисления.ВидыНалогов.ПрочиеНалогиИСборы;
	КонецЕсли;
	
	ТаблицаСоответствияСчетовУчета = ТаблицаСоответствияСчетовУчета();
	НайденныеСтроки = ТаблицаСоответствияСчетовУчета.НайтиСтроки(Новый Структура("СчетУчета", СчетУчета));
	
	Если НайденныеСтроки.Количество() = 1 Тогда
		
		ВидНалога = НайденныеСтроки[0].ВидНалога;
		
	ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
		// На одном счете учитываются разные виды налогов
		Если СчетУчета = ПланыСчетов.Хозрасчетный.РасчетыСБюджетом И ЗначениеЗаполнено(УровеньБюджета) Тогда
			
			Если УровеньБюджета = Перечисления.УровниБюджетов.РегиональныйБюджет Тогда
				ВидНалога = Перечисления.ВидыНалогов.НалогНаПрибыль_РегиональныйБюджет;
			Иначе
				ВидНалога = Перечисления.ВидыНалогов.НалогНаПрибыль_ФедеральныйБюджет;
			КонецЕсли;
			
		ИначеЕсли СчетУчета = ПланыСчетов.Хозрасчетный.ЕНприУСН И ЗначениеЗаполнено(Организация) Тогда
			
			Если УчетнаяПолитика.ОбъектНалогообложенияУСН(Организация, Период) = Перечисления.ОбъектыНалогообложенияПоУСН.Доходы Тогда
				ВидНалога = Перечисления.ВидыНалогов.УСН_Доходы;
			Иначе
				ВидНалога = Перечисления.ВидыНалогов.УСН_ДоходыМинусРасходы;
			КонецЕсли;
			
		ИначеЕсли СчетУчета = ПланыСчетов.Хозрасчетный.НДС
			Или СчетУчета = ПланыСчетов.Хозрасчетный.НДСНалоговогоАгента
			Или СчетУчета = ПланыСчетов.Хозрасчетный.НДСТаможенныйСоюзКУплате Тогда
			
			ВидНалога = Перечисления.ВидыНалогов.НДС;
			
		Иначе
			// Проверим - возможно используется только один вид налога
			ВидНалога = ПрименяемыйВидНалогаПоСчетуУчета(СчетУчета, ОбщегоНазначения.ВыгрузитьКолонку(НайденныеСтроки, "ВидНалога", Истина));
		КонецЕсли;
		
	Иначе
		
		ВидНалога = Перечисления.ВидыНалогов.ПрочиеНалогиИСборы;
		
	КонецЕсли;
	
	Возврат ВидНалога;
	
КонецФункции

Функция ВидНалогаПоКодуЗадачи(КодЗадачи, Организация, Знач Период = Неопределено) Экспорт
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ПустаяСтрока(КодЗадачи) Тогда
		Возврат Перечисления.ВидыНалогов.ПустаяСсылка();
	КонецЕсли;
	
	ТаблицаСоответствияЗадачБухгалтера = ТаблицаСоответствияЗадачБухгалтера();
	НайденныеСтроки = ТаблицаСоответствияЗадачБухгалтера.НайтиСтроки(Новый Структура("КодЗадачи", КодЗадачи));
	
	Если НайденныеСтроки.Количество() = 1 Тогда
		
		ВидНалога = НайденныеСтроки[0].ВидНалога;
		
	ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
		// Налог учитывается на нескольких счетах
		Если КодЗадачи = "УСН" И ЗначениеЗаполнено(Организация) Тогда
			Если УчетнаяПолитика.ОбъектНалогообложенияУСН(Организация, Период) = Перечисления.ОбъектыНалогообложенияПоУСН.Доходы Тогда
				ВидНалога = Перечисления.ВидыНалогов.УСН_Доходы;
			Иначе
				ВидНалога = Перечисления.ВидыНалогов.УСН_ДоходыМинусРасходы;
			КонецЕсли;
		Иначе
			ВидНалога = Перечисления.ВидыНалогов.ПустаяСсылка();
		КонецЕсли;
	Иначе
		ВидНалога = Перечисления.ВидыНалогов.ПрочиеНалогиИСборы;
	КонецЕсли;
	
	Возврат ВидНалога;
	
КонецФункции

// Возвращает уровень бюджета для указанного налога
//
Функция УровеньБюджета(ВидНалога) Экспорт
	
	Если ВидНалога = Перечисления.ВидыНалогов.НалогНаПрибыль_ФедеральныйБюджет
		Или ВидНалога = Перечисления.ВидыНалогов.ЕСХН Тогда
		УровеньБюджета = Перечисления.УровниБюджетов.ФедеральныйБюджет;
	ИначеЕсли ВидНалога = Перечисления.ВидыНалогов.НалогНаПрибыль_РегиональныйБюджет Тогда
		УровеньБюджета = Перечисления.УровниБюджетов.РегиональныйБюджет;
	Иначе
		УровеньБюджета = Перечисления.УровниБюджетов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат УровеньБюджета;
	
КонецФункции

Функция НалоговыйАгент(ВидНалога) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидНалога) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВидНалога = Перечисления.ВидыНалогов.НДФЛ Тогда
		НалоговыйАгент = Истина;
	Иначе
		НалоговыйАгент = Ложь;
	КонецЕсли;
	
	Возврат НалоговыйАгент;
	
КонецФункции

// Возвращает необходимые виды налогов для ИБ
//
Функция НеобходимыеВидыНалогов() Экспорт
	
	ВидыНалогов = Новый Массив;
	
	Если УчетЗарплаты.ИспользуетсяПодсистемаУчетаЗарплатыИКадров() Тогда
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.НДФЛ);
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС);
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС_НСиПЗ);
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_СтраховаяЧасть);
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ФФОМС);
		Если УчетЗарплаты.ИспользуетсяТрудЧленовЛетныхЭкипажей() Тогда
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ЛетныеЭкипажи);
		КонецЕсли;
		Если УчетЗарплаты.ИспользуетсяТрудШахтеров() Тогда
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_Шахтеры);
		КонецЕсли;
		Если УчетЗарплаты.ИспользуютсяРаботыСДосрочнойПенсией() Тогда
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ВредныеУсловия);
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ТяжелыеУсловия);
		КонецЕсли;
		Если УчетЗарплаты.УдерживаютсяДобровольныеВзносыВПФР() Тогда
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_Добровольные);
		КонецЕсли;
	КонецЕсли;
	
	ИспользуемыеСистемыНалогообложения = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПолучитьИспользуемыеСистемыНалогообложения();
	
	Если ИспользуемыеСистемыНалогообложения.ИспользуетсяОСНО
		Или ИспользуемыеСистемыНалогообложения.ИспользуетсяНДФЛИП Тогда
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.НДС);
	КонецЕсли;
	
	Если ИспользуемыеСистемыНалогообложения.ИспользуетсяОСНО Тогда
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.НалогНаПрибыль_ФедеральныйБюджет);
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.НалогНаПрибыль_РегиональныйБюджет);
	КонецЕсли;
	
	Если ИспользуемыеСистемыНалогообложения.ИспользуетсяУСНДоходы Тогда
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.УСН_Доходы);
	КонецЕсли;
	
	Если ИспользуемыеСистемыНалогообложения.ИспользуетсяУСНДоходыМинусРасходы Тогда
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.УСН_ДоходыМинусРасходы);
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.УСН_МинимальныйНалог);
	КонецЕсли;
	
	Если ИспользуемыеСистемыНалогообложения.ИспользуетсяНДФЛИП Тогда
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.НДФЛ_ИП);
	КонецЕсли;
	
	Если ИспользуемыеСистемыНалогообложения.ИспользуетсяЕНВД Тогда
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ЕНВД);
	КонецЕсли;
	
	Если Константы.ВестиУчетИндивидуальногоПредпринимателя.Получить() Тогда
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_СтраховаяЧасть);
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_ФФОМС);
		Если РегистрыСведений.УчетнаяПолитикаОрганизаций.УплачиваютсяДобровольныеВзносыВФСС() Тогда
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ФиксированныеВзносы_ФСС);
		КонецЕсли;
	КонецЕсли;
	
	Если Константы.ВестиУчетЮридическогоЛица.Получить() И Константы.ВедетсяУчетОсновныхСредств.Получить() Тогда
		
		ВидыНалогов.Добавить(Перечисления.ВидыНалогов.НалогНаИмущество);
		
		Если Перечисления.УсловияПримененияТребованийЗаконодательства.ЕстьИмуществоЕСГС() Тогда
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.НалогНаИмуществоЕСГС);
		КонецЕсли;
		
		Если Перечисления.УсловияПримененияТребованийЗаконодательства.ЕстьТранспортныеСредства() Тогда
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ТранспортныйНалог);
		КонецЕсли;
		
		Если Перечисления.УсловияПримененияТребованийЗаконодательства.ЕстьЗемельныеУчасткиПоКатегорямПодчинения("103") Тогда
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ЗемельныйНалог_ГородФедеральногоЗначения);
		КонецЕсли;
		
		Если Перечисления.УсловияПримененияТребованийЗаконодательства.ЕстьЗемельныеУчасткиПоКатегорямПодчинения("204") Тогда
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ЗемельныйНалог_ГородскойОкруг);
		КонецЕсли;
		
		Если Перечисления.УсловияПримененияТребованийЗаконодательства.ЕстьЗемельныеУчасткиПоКатегорямПодчинения("211") Тогда
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ЗемельныйНалог_ГородскойОкругСВнутригородскимДелением);
		КонецЕсли;
		
		Если Перечисления.УсловияПримененияТребованийЗаконодательства.ЕстьЗемельныеУчасткиПоКатегорямПодчинения("212") Тогда
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ЗемельныйНалог_ВнутригородскойОкруг);
		КонецЕсли;
		
		Если Перечисления.УсловияПримененияТребованийЗаконодательства.ЕстьЗемельныеУчасткиПоКатегорямПодчинения("305") Тогда
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ЗемельныйНалог_МежселеннаяТерритория);
		КонецЕсли;
		
		Если Перечисления.УсловияПримененияТребованийЗаконодательства.ЕстьЗемельныеУчасткиПоКатегорямПодчинения("310") Тогда
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ЗемельныйНалог_СельскоеПоселение);
		КонецЕсли;
		
		Если Перечисления.УсловияПримененияТребованийЗаконодательства.ЕстьЗемельныеУчасткиПоКатегорямПодчинения("313") Тогда
			ВидыНалогов.Добавить(Перечисления.ВидыНалогов.ЗемельныйНалог_ГородскоеПоселение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВидыНалогов;
	
КонецФункции

Функция ВидыНалогов() Экспорт
	
	Результат = Новый Структура;
	
	КоллекцияМетаданных = Перечисления.ВидыНалогов.Получить(0).Метаданные().ЗначенияПеречисления;
	
	Для Индекс = 0 По КоллекцияМетаданных.Количество() - 1 Цикл
		Результат.Вставить(КоллекцияМетаданных[Индекс].Имя, Перечисления.ВидыНалогов.Получить(Индекс));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗадачаБухгалтера(ВидНалога) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидНалога) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаСоответствияЗадачБухгалтера = ТаблицаСоответствияЗадачБухгалтера();
	НайденнаяСтрока = ТаблицаСоответствияЗадачБухгалтера.Найти(ВидНалога, "ВидНалога");
	
	Если НайденнаяСтрока <> Неопределено Тогда
		ЗадачаБухгалтера = Справочники.ЗадачиБухгалтера.НайтиПоКоду(НайденнаяСтрока.КодЗадачи);
	КонецЕсли;
	
	Возврат ЗадачаБухгалтера;
	
КонецФункции

#КонецОбласти

#Область АналитикаНаСчетах68и69

// В качестве РегистрацияВНалоговомОргане можно передавать КПП. В этом случае регистрация ищется по КПП
Функция АналитикаНаСчетеРасчетовСБюджетом(Счет, Организация, РегистрацияВНалоговомОргане, ВидНалоговогоОбязательства, КБК, ОснованиеПлатежа, ТипПлатежа, ВключаяОборотныеСубконто = Истина) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВидСубконто",  Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные"));
	Результат.Колонки.Добавить("НомерНаСчете", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Значение");
	
	ВидыСубконтоСчета = Счет.ВидыСубконто;
	
	Для НомерСубконто = 1 По ВидыСубконтоСчета.Количество() Цикл
		
		ВидСубконтоНаСчете = ВидыСубконтоСчета[НомерСубконто - 1];
		
		Если Не ВключаяОборотныеСубконто И ВидСубконтоНаСчете.ТолькоОбороты Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяСубконто = ВидСубконтоНаСчете.ВидСубконто.ИмяПредопределенныхДанных;
		
		Если ИмяСубконто = "ВидыПлатежейВГосБюджет" Тогда
			Если ЗначениеЗаполнено(ВидНалоговогоОбязательства) Тогда
				Значение = ВидНалоговогоОбязательства;
			Иначе
				Значение = ВидПлатежаВГосБюджет(КБК, ОснованиеПлатежа, ТипПлатежа);
			КонецЕсли;
		ИначеЕсли ИмяСубконто = "УровниБюджетов" Тогда
			Значение = УровеньБюджета(КБК);
		ИначеЕсли ИмяСубконто = "РегистрацияВНалоговомОргане" Тогда
			Значение = РегистрацияВНалоговомОргане;
		Иначе
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ВидСубконто  = ВидСубконтоНаСчете.ВидСубконто;
		НоваяСтрока.НомерНаСчете = НомерСубконто;
		НоваяСтрока.Значение     = Значение;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция ВидПлатежаВГосБюджет(КБК, КодОснования, ТипПлатежа = Неопределено)
	
	Если Не ПлатежиВБюджетКлиентСервер.КБКЗадан(КБК) Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.ПустаяСсылка");
	КонецЕсли;
	
	Если ПлатежиВБюджетКлиентСервер.ЭтоКБКПениПроценты(КБК) 
		Или ТипПлатежа = ПлатежиВБюджетКлиентСервер.ТипПлатежаПени() Тогда
		
		Если ПлатежиВБюджетКлиентСервер.ЭтоПогашениеЗадолженностиПоАктуПроверки(КодОснования) Тогда
			Возврат ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.ПениАкт");
		Иначе
			Возврат ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.ПениСам");
		КонецЕсли;
		
	ИначеЕсли ПлатежиВБюджетКлиентСервер.ЭтоКБКПениПроценты(КБК) 
		Или ТипПлатежа = ПлатежиВБюджетКлиентСервер.ТипПлатежаПроценты() Тогда
		
		Возврат ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.Проценты");
		
	ИначеЕсли ПлатежиВБюджетКлиентСервер.ЭтоКБКШтраф(КБК) 
		Или ПлатежиВБюджетКлиентСервер.ЭтоТипПлатежаШтраф(ТипПлатежа) Тогда
		
		Возврат ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.Штраф");
		
	ИначеЕсли ПлатежиВБюджетКлиентСервер.ЭтоДобровольноеПогашениеЗадолженности(КодОснования) Тогда
		
		Возврат ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.НалогСам");
		
	ИначеЕсли ПлатежиВБюджетКлиентСервер.ЭтоПогашениеЗадолженностиПоАктуПроверки(КодОснования) Тогда
		
		Возврат ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.НалогАкт");
		
	Иначе
		
		Возврат ПредопределенноеЗначение("Перечисление.ВидыПлатежейВГосБюджет.Налог");
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииВидовНалогов

Функция ТаблицаСоответствияСчетовУчета()
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("ВидНалога", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалогов"));
	ТаблицаЗначений.Колонки.Добавить("СчетУчета", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ, ПланыСчетов.Хозрасчетный.НДФЛ);
	
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.НДС, ПланыСчетов.Хозрасчетный.НДС);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.НДС, ПланыСчетов.Хозрасчетный.НДСНалоговогоАгента);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.НДС, ПланыСчетов.Хозрасчетный.НДСТаможенныйСоюзКУплате);
	
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.НалогНаПрибыль_ФедеральныйБюджет,  ПланыСчетов.Хозрасчетный.РасчетыСБюджетом);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.НалогНаПрибыль_РегиональныйБюджет, ПланыСчетов.Хозрасчетный.РасчетыСБюджетом);
	
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ГородФедеральногоЗначения,              ПланыСчетов.Хозрасчетный.ЗемельныйНалог);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ГородскойОкруг,                         ПланыСчетов.Хозрасчетный.ЗемельныйНалог);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ГородскойОкругСВнутригородскимДелением, ПланыСчетов.Хозрасчетный.ЗемельныйНалог);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ВнутригородскойОкруг,                   ПланыСчетов.Хозрасчетный.ЗемельныйНалог);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_МежселеннаяТерритория,                  ПланыСчетов.Хозрасчетный.ЗемельныйНалог);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_СельскоеПоселение,                      ПланыСчетов.Хозрасчетный.ЗемельныйНалог);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ГородскоеПоселение,                     ПланыСчетов.Хозрасчетный.ЗемельныйНалог);
	
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ТранспортныйНалог, ПланыСчетов.Хозрасчетный.ТранспортныйНалог);
	
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.НалогНаИмущество,     ПланыСчетов.Хозрасчетный.НалогНаИмущество);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.НалогНаИмуществоЕСГС, ПланыСчетов.Хозрасчетный.НалогНаИмущество);
	
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ЕНВД, ПланыСчетов.Хозрасчетный.ЕНВД);
	
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.УСН_Доходы,             ПланыСчетов.Хозрасчетный.ЕНприУСН);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.УСН_ДоходыМинусРасходы, ПланыСчетов.Хозрасчетный.ЕНприУСН);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.УСН_МинимальныйНалог,   ПланыСчетов.Хозрасчетный.ЕНприУСН);
	
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ_ИП, ПланыСчетов.Хозрасчетный.НДФЛ_ИП);
	
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ЕСХН, ПланыСчетов.Хозрасчетный.ПрочиеНалогиИСборы);
	
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_СтраховаяЧасть,      ПланыСчетов.Хозрасчетный.ПФР_ОПС);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_СтраховаяЧасть,      ПланыСчетов.Хозрасчетный.ПФР_страх);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_НакопительнаяЧасть,  ПланыСчетов.Хозрасчетный.ПФР_нак);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ФФОМС,                   ПланыСчетов.Хозрасчетный.ФФОМС);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС,                     ПланыСчетов.Хозрасчетный.ФСС);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС_НСиПЗ,               ПланыСчетов.Хозрасчетный.ФСС_НСиПЗ);
	
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ЛетныеЭкипажи,  ПланыСчетов.Хозрасчетный.ПФР_доп);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_Шахтеры,        ПланыСчетов.Хозрасчетный.ПФР_доп_шахтеры);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ВредныеУсловия, ПланыСчетов.Хозрасчетный.ПФР_доп_ВредныеУсловияТруда);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ТяжелыеУсловия, ПланыСчетов.Хозрасчетный.ПФР_доп_ТяжелыеУсловияТруда);
	
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_СтраховаяЧасть,     ПланыСчетов.Хозрасчетный.ПФР_ОПС_ИП);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_СтраховаяЧасть,     ПланыСчетов.Хозрасчетный.ПФР_Страх_СтраховойГод);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_НакопительнаяЧасть, ПланыСчетов.Хозрасчетный.ПФР_Нак_СтраховойГод);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ФиксированныеВзносы_ФФОМС,                  ПланыСчетов.Хозрасчетный.ФОМС_СтраховойГод);
	ДобавитьСчетУчета(ТаблицаЗначений, Перечисления.ВидыНалогов.ФиксированныеВзносы_ФСС,                    ПланыСчетов.Хозрасчетный.ФСС_СтраховойГод);
	
	Возврат ТаблицаЗначений;
	
КонецФункции

Процедура ДобавитьСчетУчета(ТаблицаЗначений, ВидНалога, СчетУчета)
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	НоваяСтрока.ВидНалога = ВидНалога;
	НоваяСтрока.СчетУчета = СчетУчета;
	
КонецПроцедуры

Функция ТаблицаСоответствияЗадачБухгалтера()
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("ВидНалога", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалогов"));
	ТаблицаЗначений.Колонки.Добавить("КодЗадачи", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДС, "НДС");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НалогНаПрибыль_ФедеральныйБюджет,  "НалогНаПрибыль");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НалогНаПрибыль_РегиональныйБюджет, "НалогНаПрибыль");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ГородФедеральногоЗначения,              "ЗемельныйНалог");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ГородскойОкруг,                         "ЗемельныйНалог");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ГородскойОкругСВнутригородскимДелением, "ЗемельныйНалог");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ВнутригородскойОкруг,                   "ЗемельныйНалог");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_МежселеннаяТерритория,                  "ЗемельныйНалог");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_СельскоеПоселение,                      "ЗемельныйНалог");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ГородскоеПоселение,                     "ЗемельныйНалог");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ТранспортныйНалог, "ТранспортныйНалог");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НалогНаИмущество,     "НалогНаИмущество");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НалогНаИмуществоЕСГС, "НалогНаИмущество");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЕНВД, "ЕНВД");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.УСН_Доходы,             "УСН");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.УСН_ДоходыМинусРасходы, "УСН");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.УСН_МинимальныйНалог,   "УСН");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ_ИП, "НДФЛ_Предприниматель");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЕСХН, "ЕСХН");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_СтраховаяЧасть,      "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_НакопительнаяЧасть,  "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_Добровольные,        "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ФФОМС,                   "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС,                     "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС_НСиПЗ,               "СтраховыеВзносы");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ЛетныеЭкипажи,  "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_Шахтеры,        "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ВредныеУсловия, "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ТяжелыеУсловия, "СтраховыеВзносы");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_НакопительнаяЧасть, "СтраховыеВзносы_Предприниматель");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_СтраховаяЧасть,     "СтраховыеВзносы_Предприниматель");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ФиксированныеВзносы_ФФОМС,                  "СтраховыеВзносы_Предприниматель");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ФиксированныеВзносы_ФСС,                    "СтраховыеВзносы_Предприниматель");
	
	Возврат ТаблицаЗначений;
	
КонецФункции

Процедура ДобавитьКодЗадачи(ТаблицаЗначений, ВидНалога, КодЗадачи)
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	НоваяСтрока.ВидНалога = ВидНалога;
	НоваяСтрока.КодЗадачи = КодЗадачи;
	
КонецПроцедуры

Функция ПрименяемыйВидНалогаПоСчетуУчета(СчетУчета, ВидыНалогов = Неопределено)
	
	Если ВидыНалогов = Неопределено Тогда
		ТаблицаСоответствияСчетовУчета = ТаблицаСоответствияСчетовУчета();
		НайденныеСтроки = ТаблицаСоответствияСчетовУчета.Найти(Новый Структура("СчетУчета", СчетУчета));
		ВидыНалогов = ОбщегоНазначения.ВыгрузитьКолонку(НайденныеСтроки, "ВидНалога", Истина)
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыНалогов", ВидыНалогов);
	Запрос.УстановитьПараметр("СчетУчета",   СчетУчета);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Приоритет,
		|	ВидыНалоговИПлатежейВБюджет.ВидНалога
		|ИЗ
		|	Справочник.ВидыНалоговИПлатежейВБюджет КАК ВидыНалоговИПлатежейВБюджет
		|ГДЕ
		|	ВидыНалоговИПлатежейВБюджет.ВидНалога В(&ВидыНалогов)
		|	И ВидыНалоговИПлатежейВБюджет.СчетУчета = &СчетУчета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		ВидНалога = Выборка.ВидНалога;
	Иначе
		ВидНалога = Перечисления.ВидыНалогов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ВидНалога;
	
КонецФункции

#КонецОбласти

#КонецЕсли
